'''
フィボナッチ数列の項は前の2つの項の和である. 最初の2項を 1, 2 とすれば, 最初の10項は以下の通りである.
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
数列の項の値が400万以下の, 偶数値の項の総和を求めよ.
'''
def main():
    #フィボナッチ数列の偶奇の並びは以下
    #(奇偶)(奇奇偶)(奇奇偶)(奇奇偶)…

    a = 1
    b = 2
    n = 0
    i = 0
    total = 0
    while True:
        i += 1
        n = a + b
        a = b
        b = n
        if n <= 4000000:
            if i % 3 == 0:
                total += n
        else:
            break
    total += 2
    print(total)


    

if __name__ == '__main__':
    main()