# coding: utf-8
'''
単位分数とは分子が1の分数である. 分母が2から10の単位分数を10進数で表記すると次のようになる.
1/2 = 0.5
1/3 = 0.(3)
1/4 = 0.25
1/5 = 0.2
1/6 = 0.1(6)
1/7 = 0.(142857)
1/8 = 0.125
1/9 = 0.(1)
1/10 = 0.1
0.1(6)は 0.166666... という数字であり, 1桁の循環節を持つ. 1/7 の循環節は6桁ある.
d < 1000 なる 1/d の中で小数部の循環節が最も長くなるような d を求めよ.
'''


def repeat_len(d):
    n = 1
    m = 10 % d
    while m != 1:
        n += 1
        m = (m * 10) % d
    return n


def solver(d):
    k = 0
    m = 0
    if d % 2 == 0:
        d -= 1
    while k < d:
        if d % 5 != 0:
            n = repeat_len(d)
            if n > k:
                k = n
                m = d
        d -= 2
    return m, k


def main():
    print(solver(1000))


if __name__ == '__main__':
    main()
